---
kind: type
id: T:Autodesk.Revit.DB.FamilyParameter
source: html/6175e974-870e-7fbc-3df7-46105f937a6e.htm
---
# Autodesk.Revit.DB.FamilyParameter

The family parameter object.

## Syntax (C#)
```csharp
public class FamilyParameter : APIObject
```